// *++
//
// Copyright 2005, Intel Corporation                                                         
// All rights reserved. This program and the accompanying materials                          
// are licensed and made available under the terms and conditions of the BSD License         
// which accompanies this distribution. The full text of the license may be found at         
// http://opensource.org/licenses/bsd-license.php                                            
//                                                                                           
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,                     
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.             
// 
// Module Name:
//
//   ResetStrings.uni
// 
// Abstract:
// 
//   String definitions for the Shell reset command
// 
// Revision History:
// 
// --*/

/=#

#langdef   eng "English"

#string STR_RESET_LINE_HELP            #language eng  "Resets the system"

#string STR_RESET_VERBOSE_HELP         #language eng  "Resets the system.\n"
                                                      "\n"
                                                      "RESET [-w [string]]\n"
                                                      "RESET [-s [string]]\n"
                                                      "\n"
                                                      "    -w         - Performs a warm reset\n"
                                                      "    -s         - Performs a shutdown\n"
                                                      "    string     - String to be passed to reset service\n"
                                                      "\n"
                                                      "Note:\n"
                                                      "   1. Not all systems implement '-w' flag. This may mean different things \n"
                                                      "      depending on which BIOS EFI is implemented.\n"
                                                      "   2. Reset will be guaranteed to reset the chipset as well as the processor\n"
                                                      "      when cold reset is called.\n"
                                                      "   3. This command does not support output redirection.\n"
